tutorials/incompressible/lumpedPointMotion/building/steady/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "pcorr.*"
    {
        solver          GAMG;
        tolerance       1e-2;
        relTol          0;
        smoother        GaussSeidel;
    }

    p
    {
        $pcorr;
        tolerance       1e-7;
        relTol          0.01;
    }

    "(cellDisplacement)"
    {
        $p;
        tolerance       1e-6;
        relTol          0.001;
        minIter         1;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    }

    cellDisplacementFinal
    {
        $cellDisplacement;
        tolerance       1e-6;
        relTol          0;
    }

    Phi
    {
        $p;
    }

    "(U|k|epsilon|omega)"
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.1;
        nSweeps          1;
    }

    "(U|k|epsilon|omega)Final"
    {
        $U;
        relTol           0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent  yes;
    pRefCell    0;
    pRefValue   0;
}

PIMPLE
{
    nOuterCorrectors 2;
    nCorrectors      1;
    nNonOrthogonalCorrectors 0;
    pRefCell    0;
    pRefValue   0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

cache
{
    grad(U);
}


// Default relaxation for transient
relaxationFactors
{
    equations
    {
        ".*"        1;
    }
}

// Embed steady-state settings (simpleFoam) without changeDictionary
_simpleFoam
{
    fields
    {
        p      1.0;
    }

    equations
    {
        "(U|k|epsilon)"   0.9;
    }
}

relaxationFactors
{
    ${_${FOAM_EXECUTABLE}};
}

#remove _simpleFoam

// ************************************************************************* //
